[Killed] BlockStatement
middleware/auth.js:3:44
 const jwt = require('jsonwebtoken');
 
-module.exports = function (req, res, next) {
-    // 1. Leer el token del header
-    const token = req.header('x-auth-token');
-
-    // 2. Revisar si no hay token
-    if (!token) {
-        return res.status(401).json({ msg: 'No hay token, permiso no válido' });
-    }
-
-    // 3. Validar el token
-    try {
-        const cifrado = jwt.verify(token, process.env.SECRETA);
-        req.usuario = cifrado.usuario;
-        next();
-    } catch (error) {
-        res.status(401).json({ msg: 'Token no válido' });
-    }
-};
+module.exports = function (req, res, next) {};
killedBy: Unit Test: Middleware de Autenticación (Jest) Debe devolver 401 si no hay token en el header
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401

Number of calls: 0

[Killed] BlockStatement
middleware/auth.js:8:17
     const token = req.header('x-auth-token');
 
     // 2. Revisar si no hay token
-    if (!token) {
-        return res.status(401).json({ msg: 'No hay token, permiso no válido' });
-    }
+    if (!token) {}
 
     // 3. Validar el token
killedBy: Unit Test: Middleware de Autenticación (Jest) Debe devolver 401 si no hay token en el header
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "msg": "No hay token, permiso no válido",
+   "msg": "Token no válido",

[Killed] BooleanLiteral
middleware/auth.js:8:9
     const token = req.header('x-auth-token');
 
     // 2. Revisar si no hay token
-    if (!token) {
+    if (token) {
         return res.status(401).json({ msg: 'No hay token, permiso no válido' });
     }
killedBy: Unit Test: Middleware de Autenticación (Jest) Debe devolver 401 si no hay token en el header
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "msg": "No hay token, permiso no válido",
+   "msg": "Token no válido",

[Killed] BlockStatement
middleware/auth.js:13:9
     }
 
     // 3. Validar el token
-    try {
-        const cifrado = jwt.verify(token, process.env.SECRETA);
-        req.usuario = cifrado.usuario;
-        next();
-    } catch (error) {
+    try {} catch (error) {
         res.status(401).json({ msg: 'Token no válido' });
     }
killedBy: Unit Test: Middleware de Autenticación (Jest) Debe llamar a next() si el token es válido
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[NoCoverage] BlockStatement
middleware/auth.js:17:21
         const cifrado = jwt.verify(token, process.env.SECRETA);
         req.usuario = cifrado.usuario;
         next();
-    } catch (error) {
-        res.status(401).json({ msg: 'Token no válido' });
-    }
+    } catch (error) {}
 };
