[NoCoverage] ObjectLiteral
models/Usuario.js:18:43
 });
 
 // 3. Esquema PRINCIPAL del Usuario
-const usuarioSchema = new mongoose.Schema({
-  email: { type: String, required: true, unique: true },
-  password: { type: String, required: true },
-  nombre: { type: String, required: true }, 
-  tagClash: { type: String, required: true }, 
-  edad: Number,
-  nacionalidad: String,
-  modalidad_preferida: String,
-  
-  mazos: [mazoSchema],
-  
-  fechaRegistro: { type: Date, default: Date.now }
-});
+const usuarioSchema = new mongoose.Schema({});
 
 module.exports = mongoose.model('Usuario', usuarioSchema);

[NoCoverage] BooleanLiteral
models/Usuario.js:19:36
 
 // 3. Esquema PRINCIPAL del Usuario
 const usuarioSchema = new mongoose.Schema({
-  email: { type: String, required: true, unique: true },
+  email: { type: String, required: false, unique: true },
   password: { type: String, required: true },
   nombre: { type: String, required: true }, 

[NoCoverage] BooleanLiteral
models/Usuario.js:19:50
 
 // 3. Esquema PRINCIPAL del Usuario
 const usuarioSchema = new mongoose.Schema({
-  email: { type: String, required: true, unique: true },
+  email: { type: String, required: true, unique: false },
   password: { type: String, required: true },
   nombre: { type: String, required: true }, 

[NoCoverage] BooleanLiteral
models/Usuario.js:20:39
 // 3. Esquema PRINCIPAL del Usuario
 const usuarioSchema = new mongoose.Schema({
   email: { type: String, required: true, unique: true },
-  password: { type: String, required: true },
+  password: { type: String, required: false },
   nombre: { type: String, required: true }, 
   tagClash: { type: String, required: true }, 

[NoCoverage] BooleanLiteral
models/Usuario.js:21:37
 const usuarioSchema = new mongoose.Schema({
   email: { type: String, required: true, unique: true },
   password: { type: String, required: true },
-  nombre: { type: String, required: true }, 
+  nombre: { type: String, required: false }, 
   tagClash: { type: String, required: true }, 
   edad: Number,

[NoCoverage] ObjectLiteral
models/Usuario.js:21:11
 const usuarioSchema = new mongoose.Schema({
   email: { type: String, required: true, unique: true },
   password: { type: String, required: true },
-  nombre: { type: String, required: true }, 
+  nombre: {}, 
   tagClash: { type: String, required: true }, 
   edad: Number,

[NoCoverage] BooleanLiteral
models/Usuario.js:22:39
   email: { type: String, required: true, unique: true },
   password: { type: String, required: true },
   nombre: { type: String, required: true }, 
-  tagClash: { type: String, required: true }, 
+  tagClash: { type: String, required: false }, 
   edad: Number,
   nacionalidad: String,

[NoCoverage] ObjectLiteral
models/Usuario.js:29:18
   
   mazos: [mazoSchema],
   
-  fechaRegistro: { type: Date, default: Date.now }
+  fechaRegistro: {}
 });
 
