[Survived] BooleanLiteral
models/Partido.js:4:78
 const mongoose = require('mongoose');
 
 const PartidoSchema = new mongoose.Schema({
-    torneo: { type: mongoose.Schema.Types.ObjectId, ref: 'Torneo', required: true },
+    torneo: { type: mongoose.Schema.Types.ObjectId, ref: 'Torneo', required: false },
     ronda: { type: Number, required: true },
     jugador1: { type: mongoose.Schema.Types.ObjectId, ref: 'Usuario' },

[Survived] BooleanLiteral
models/Partido.js:5:38
 
 const PartidoSchema = new mongoose.Schema({
     torneo: { type: mongoose.Schema.Types.ObjectId, ref: 'Torneo', required: true },
-    ronda: { type: Number, required: true },
+    ronda: { type: Number, required: false },
     jugador1: { type: mongoose.Schema.Types.ObjectId, ref: 'Usuario' },
     jugador2: { type: mongoose.Schema.Types.ObjectId, ref: 'Usuario' },

[Survived] StringLiteral
models/Partido.js:7:60
     torneo: { type: mongoose.Schema.Types.ObjectId, ref: 'Torneo', required: true },
     ronda: { type: Number, required: true },
     jugador1: { type: mongoose.Schema.Types.ObjectId, ref: 'Usuario' },
-    jugador2: { type: mongoose.Schema.Types.ObjectId, ref: 'Usuario' },
+    jugador2: { type: mongoose.Schema.Types.ObjectId, ref: "" },
     ganador: { type: mongoose.Schema.Types.ObjectId, ref: 'Usuario' },
     marcador: {

[Survived] BooleanLiteral
models/Partido.js:13:39
         coronasJ1: { type: Number, default: 0 },
         coronasJ2: { type: Number, default: 0 }
     },
-    jugado: { type: Boolean, default: false }
+    jugado: { type: Boolean, default: true }
 });
 

[Survived] ObjectLiteral
models/Partido.js:13:13
         coronasJ1: { type: Number, default: 0 },
         coronasJ2: { type: Number, default: 0 }
     },
-    jugado: { type: Boolean, default: false }
+    jugado: {}
 });
 
